src/Documents/ПоступлениеДопРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеДопРасходов</Name>
			<Comment>Поступление дополнительных расходов</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.Комплектация</xr:Item>
				<xr:Item>Document.Разукомплектация</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.ТаможеннаяДекларацияИмпорт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыКомпании</xr:Item>
				<xr:Item>InformationRegister.ДопроведениеПоПартиям</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Комплектация</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Разукомплектация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен прихода</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, оказывающий услуги</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДокДата</Name>
					<Comment>Дата входящего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДокНомер</Name>
					<Comment>Номер входящего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольОстаткаПартии</Name>
					<Comment>Контролировать остаток партии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоЗакрытиеСделок</Name>
					<Comment>Если флажок установлен, то при проведении документа сначала будут оплачены все незакрытые сделки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Оказываемые услуги</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (услуга)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма, НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Итоговая сумма по строке документа со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Comment>Способ распределения услуги по товарам</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
					<Comment>Документы основания</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Comment>Документ, на который будут распределятся дополнительные расходы</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.Комплектация</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.Разукомплектация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеРасходов</Name>
					<Comment>Распределение расходов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Comment>Документ, на который будут распределятся дополнительные расходы</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.Комплектация</v8:Type>
								<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.Разукомплектация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Comment>Номенклатура (услуга)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураРаспределения</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТД</Name>
							<Comment>Номер грузовой таможенной декларации (для товаров поступивших по импорту)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СпособыРаспределенияДопРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыРаспределенияДопРасходов</Name>
			<Comment>Способы распределения суммы по строкам номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСумме</Name>
					<Comment>Распределение на себестоимость по сумме</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличеству</Name>
					<Comment>Распределение на себестоимость по количеству</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВесу</Name>
					<Comment>Распределение на себестоимость по весу</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДоходыИРасходы</Name>
					<Comment>Без распределения на себестоимость</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/РежимыВыводаКодаВДокументах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РежимыВыводаКодаВДокументах</Name>
			<Comment>Вид кода для вывода в табличных частях и печатных формах товарных документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
					<Comment>Код номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодИАртикул</Name>
					<Comment>Код и артикул</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПоступлениеДопРасходов/Forms/РаспределениеДополнительныхРасходовПоТоварам/Ext/Form/Module.bsl
// Модуль произвольной формы документа "Поступление дополнительных расходов" "Распределение дополнительных расходов по товарам".


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Настройка условного оформления формы
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоНоменклатурыСуммаДопРасходов");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНоменклатуры.ДокументОснование");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоНоменклатурыХарактеристикаНоменклатуры");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНоменклатуры.ДокументОснование");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНоменклатуры.ХарактеристикаНоменклатуры");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<без характеристик>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Функция для получения автоматического распределения суммы услуги по номенклатуре документов-оснований.
//
&НаСервере
Функция АвтоматическоеРаспределениеСуммыУслуги(СтрокаУслуги, РаспределятьПоУслуге = Ложь)
	
	НаименованиеУслуги = СтрокаУслуги.Номенклатура.НаименованиеПолное;
	
	ТаблицаНоменклатурыРаспределения = ТаблицаОснований.Выгрузить();
	
	// Проверим по текущему распределению, т.к. возможны изменения в составе номенклатуры.
	Если РаспределятьПоУслуге Тогда
		// Проверим наличие ручного распределения услуги
		НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(Новый Структура("Услуга", СтрокаУслуги.Номенклатура));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТаблицаНоменклатурыРаспределения.Очистить();
			Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
				СтруктураПоиска = Новый Структура("ДокументОснование, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, ГТД");
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
				НайденнаяНоменклатура = ТаблицаОснований.НайтиСтроки(СтруктураПоиска);
				Если НайденнаяНоменклатура.Количество() > 0 Тогда
					НоваяСтрока = ТаблицаНоменклатурыРаспределения.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяНоменклатура[0]);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// автоматическое распределение
	ВременнаяТаблицаОснований = ТаблицаНоменклатурыРаспределения.Скопировать();
	ВременнаяТаблицаОснований.Очистить();
	
	// Вычислим общую сумму документов
	ИтогДокументКоличество = ТаблицаНоменклатурыРаспределения.Итог("Количество");
	ИтогДокументСумма      = ТаблицаНоменклатурыРаспределения.Итог("СуммаВсего"); 
	ИтогДокументВес        = ТаблицаНоменклатурыРаспределения.Итог("Вес");
	
	СпособРаспределенияУслуги = СтрокаУслуги.Номенклатура.СпособРаспределенияДопРасходов;
	СуммаНДСУслуги = СтрокаУслуги.Сумма - СтрокаУслуги.СуммаБезНДС;
	СуммаУслуги = СтрокаУслуги.Сумма;
	СуммаПоСумме = 0;
	СуммаНДСПоСумме = 0;
	СуммаПоКоличеству = 0;
	СуммаНДСПоКоличеству = 0;
	СуммаПоВесу = 0;
	СуммаНДСПоВесу = 0;
	
	Если СпособРаспределенияУслуги = Перечисления.СпособыРаспределенияДопРасходов.ПоСумме Тогда
		СуммаПоСумме = СуммаУслуги;
		СуммаНДСПоСумме = СуммаНДСУслуги;
	ИначеЕсли СпособРаспределенияУслуги = Перечисления.СпособыРаспределенияДопРасходов.ПоКоличеству Тогда
		СуммаПоКоличеству = СуммаУслуги;
		СуммаНДСПоКоличеству = СуммаНДСУслуги;
	ИначеЕсли СпособРаспределенияУслуги = Перечисления.СпособыРаспределенияДопРасходов.ПоВесу Тогда
		СуммаПоВесу = СуммаУслуги;
		СуммаНДСПоВесу = СуммаНДСУслуги;
	КонецЕсли;
	
	СуммаРаспределения = 0;
	
	ИтогДопРасходы    = СуммаУслуги;
	ИтогДопРасходыНДС = СуммаНДСУслуги;
	
	// Вычислим ситуацию, когда
	Если (ИтогДокументКоличество=0) И (СуммаПоКоличеству<>0) Тогда
		ВывестиСообщение(НСтр("ru = 'Количество прихода равно нулю. Распределение суммы услуги ""%1"" на себестоимость прихода невозможно.'"),,,,, НаименованиеУслуги);
	КонецЕсли;
	Если (ИтогДокументСумма=0) И (СуммаПоСумме<>0) Тогда
		ВывестиСообщение(НСтр("ru = 'Себестоимость прихода равна нулю. Распределение суммы услуги ""%1"" на себестоимость прихода невозможно.'"),,,,, НаименованиеУслуги);	
	КонецЕсли;
	Если (ИтогДокументВес=0) И (СуммаПоВесу<>0) Тогда
		ВывестиСообщение(НСтр("ru = 'Вес прихода равен нулю. Распределение суммы услуги ""%1"" на себестоимость прихода невозможно.'"),,,,, НаименованиеУслуги);
	КонецЕсли;
	
	// распределяем по товарам
	Для Каждого СтрокаТоварИсх Из ТаблицаНоменклатурыРаспределения Цикл
		СтрокаТовар = ВременнаяТаблицаОснований.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовар,СтрокаТоварИсх);
		
		// Обнулим значения
		СтрокаТовар.Количество = 0;
		СтрокаТовар.СуммаВсего = 0;
		СтрокаТовар.СуммаНДС   = 0;
		
		СуммаДопРасходов=0; СуммаНДСДопРасходов=0;
		
		КоэфРаспределения    = ?(ИтогДокументКоличество=0, 0, СтрокаТоварИсх.Количество/ИтогДокументКоличество);
		СуммаДопРасходовК    = СуммаПоКоличеству    * КоэфРаспределения;
		СуммаНДСДопРасходовК = СуммаНДСПоКоличеству * КоэфРаспределения;
		
		КоэфРаспределения    = ?(ИтогДокументСумма=0, 0, СтрокаТоварИсх.СуммаВсего/ИтогДокументСумма);
		СуммаДопРасходовС    = СуммаПоСумме    * КоэфРаспределения;
		СуммаНДСДопРасходовС = СуммаНДСПоСумме * КоэфРаспределения;
		
		КоэфРаспределения    = ?(ИтогДокументВес=0, 0, СтрокаТоварИсх.Вес/ИтогДокументВес);
		СуммаДопРасходовВ    = СуммаПоВесу    * КоэфРаспределения;
		СуммаНДСДопРасходовВ = СуммаНДСПоВесу * КоэфРаспределения;
		
		СтрокаТовар.СуммаВсего = СуммаДопРасходовК + СуммаДопРасходовС + СуммаДопРасходовВ;
		СтрокаТовар.СуммаНДС   = СуммаНДСДопРасходовК + СуммаНДСДопРасходовС + СуммаНДСДопРасходовВ;
		
		ИтогДопРасходы    = ИтогДопРасходы - (СтрокаТовар.СуммаВсего);
		ИтогДопРасходыНДС = ИтогДопРасходыНДС - (СтрокаТовар.СуммаНДС);
	КонецЦикла;
	
	// если осталась сумма от округления то закинем ее на последний
	Если НЕ СпособРаспределенияУслуги = Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы И (ИтогДопРасходы<>0 ИЛИ ИтогДопРасходыНДС<>0) Тогда
		СтрокаТовар.СуммаВсего = СтрокаТовар.СуммаВсего + ИтогДопРасходы;
		СтрокаТовар.СуммаНДС   = СтрокаТовар.СуммаНДС + ИтогДопРасходыНДС;
	КонецЕсли;
	
	Возврат ВременнаяТаблицаОснований;
	
КонецФункции

// Процедура формирования дерева для вывода данных на форму
//
&НаСервере
Процедура ПолучитьДеревоРаспределенияРасходов()
	
	Если Элементы.ТаблицаУслуг.ТекущаяСтрока = Неопределено ИЛИ ТаблицаУслуг.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоНоменклатуры.ПолучитьЭлементы().Очистить();
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = ТаблицаУслуг.НайтиПоИдентификатору(Элементы.ТаблицаУслуг.ТекущаяСтрока);
	
	НаДоходыИРасходы = ТекущиеДанные.НаДоходыИРасходы;
	АвтоматическийРежимРаспределения = (РежимРаспределения = 0);
	
	Элементы.ДеревоНоменклатуры.ТолькоПросмотр = НаДоходыИРасходы И АвтоматическийРежимРаспределения;
	Элементы.ПодборНоменклатурыДокументовОснований.Доступность = НЕ НаДоходыИРасходы И НЕ АвтоматическийРежимРаспределения;
	Элементы.УдалитьНоменклатуру.Доступность = НЕ НаДоходыИРасходы И НЕ АвтоматическийРежимРаспределения;
	Элементы.ПодменюРаспределить.Доступность = НЕ НаДоходыИРасходы И НЕ АвтоматическийРежимРаспределения;
	
	Если НаДоходыИРасходы Тогда
		ТекущиеДанные.НеРаспределено = 0;
		НеРаспределеноУслуги = 0;
		Возврат;
	КонецЕсли;
	
	// Заполним документами-основаниями
	СписокОснований = ТаблицаОснований.Выгрузить(, "ДокументОснование");
	СписокОснований.Свернуть("ДокументОснование");
	
	// Заполним верхний уровень
	Для Каждого ТекущаяСтрока Из СписокОснований Цикл
		НоваяСтрока = ДеревоНоменклатуры.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ДокументОснование = ТекущаяСтрока.ДокументОснование;
	КонецЦикла;
	
	// Проверим наличие ручного распределения услуги
	НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(Новый Структура("Услуга", ТекущиеДанные.Номенклатура));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Для Каждого ТекущаяСтрока Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
			НайденныеУслуги = ТаблицаРаспределения.НайтиСтроки(Новый Структура("ДокументОснование,Услуга", ТекущаяСтрока.ДокументОснование, ТекущиеДанные.Номенклатура));
			Для Каждого ТекущаяНоменклатура Из НайденныеУслуги Цикл
				НоваяСтрока = ТекущаяСтрока.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяНоменклатура,, "ДокументОснование");
				НоваяСтрока.СуммаДопРасходов       = ТекущаяНоменклатура.Сумма;
				НоваяСтрока.СуммаДопРасходовБезНДС = ТекущаяНоменклатура.СуммаБезНДС;
			КонецЦикла;
		КонецЦикла;
	Иначе
		// получим таблицу с распределенной услугой по номенклатуре
		ТаблицаРаспределенияСумм = АвтоматическоеРаспределениеСуммыУслуги(ТекущиеДанные);
		
		СуммаРаспределения = 0;
		
		Для Каждого ТекущийДокумент Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
			НайденнаяНоменклатура = ТаблицаРаспределенияСумм.НайтиСтроки(Новый Структура("ДокументОснование", ТекущийДокумент.ДокументОснование));
			Для Каждого ТекущаяСтрока Из НайденнаяНоменклатура Цикл
				НоваяСтрока = ТекущийДокумент.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока,, "ДокументОснование");
				НоваяСтрока.Услуга = ТекущиеДанные.Номенклатура;
				НоваяСтрока.СуммаДопРасходов       = ТекущаяСтрока.СуммаВсего;
				НоваяСтрока.СуммаДопРасходовБезНДС = ТекущаяСтрока.СуммаВсего - ТекущаяСтрока.СуммаНДС;
				СуммаРаспределения = СуммаРаспределения + ТекущаяСтрока.СуммаВсего;
			КонецЦикла;
		КонецЦикла;
		
		ТекущиеДанные.НеРаспределено = ТекущиеДанные.Сумма - СуммаРаспределения;
		
		Если РедактированиеУслуги Тогда
			НеРаспределеноУслуги = ТекущиеДанные.НеРаспределено;
		КонецЕсли;
		
		ЗагрузитьДанныеРучногоРаспределенияСуммы(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры // ПолучитьДеревоРаспределенияРасходов()

// Обработчик события возникающего на клиенте при активизации строки списка услуг.
//
&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтрокиУслуг()
	
	// Все перерасчитано
	Если ИзменениеДиР Тогда
		ИзменениеДиР = Ложь;
		Возврат;
	КонецЕсли;
	
	ПолучитьДеревоРаспределенияРасходов();
	
	РазвернутьДеревоНоменклатуры();
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтрокиУслуг()

// Процедура загрузки в таблицу результата распределенную сумму дополнительных расходов.
//
&НаСервере
Процедура ЗагрузитьДанныеРучногоРаспределенияСуммы(СтрокаУслуги)
	
	// Обновим данные в результирующей таблице
	НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(Новый Структура("Услуга", СтрокаУслуги.Номенклатура));
	
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		ТаблицаРаспределения.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	// Если статья распределения ДиР, то нет необходимости заполнять
	Если СтрокаУслуги.НаДоходыИРасходы Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение таблицы ТаблицаРаспределения для данной услуги
	Для Каждого ДокументОснование Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
		Для Каждого ТекущаяСтрока Из ДокументОснование.ПолучитьЭлементы() Цикл
			НоваяСтрока = ТаблицаРаспределения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ДокументОснование = ДокументОснование.ДокументОснование;
			НоваяСтрока.Услуга            = СтрокаУслуги.Номенклатура;
			НоваяСтрока.Сумма             = ТекущаяСтрока.СуммаДопРасходов;
			НоваяСтрока.СуммаБезНДС       = ТекущаяСтрока.СуммаДопРасходовБезНДС;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры // ЗагрузитьДанныеРучногоРаспределенияСуммы()

// Процедура для отображения дерева номенклатур документов оснований после формирования.
//
&НаКлиенте
Процедура РазвернутьДеревоНоменклатуры()
	
	// Развернем дерево номенклатуры
	Для Каждого ТекущаяСтрока Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
		Элементы.ДеревоНоменклатуры.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры // РазвернутьДеревоНоменклатуры()

// Процедура для установки доступности элементов формы при изменении режима распределения.
//
&НаСервере
Процедура УстановкаРежимаРаспределения(ПересчитыватьДерево = Истина)
	
	АвтоматическийРежимРаспределения = (РежимРаспределения = 0);
	Элементы.ТаблицаУслуг.ТолькоПросмотр       = АвтоматическийРежимРаспределения;
	Элементы.ДеревоНоменклатуры.ТолькоПросмотр = АвтоматическийРежимРаспределения;
	ДоступностьКомандПодбора = РежимРаспределения = 1 И НЕ (РедактированиеУслуги И НаДоходыИРасходыУслуги);
	Элементы.ПодборНоменклатурыДокументовОснований.Доступность = ДоступностьКомандПодбора;
	Элементы.УдалитьНоменклатуру.Доступность = ДоступностьКомандПодбора;
	Элементы.ПодменюРаспределить.Доступность = ДоступностьКомандПодбора;
	
	Если РедактированиеУслуги Тогда
		Элементы.НаДоходыИРасходыУслуги.ТолькоПросмотр = АвтоматическийРежимРаспределения;
	КонецЕсли;
	
	Если АвтоматическийРежимРаспределения Тогда
		ТаблицаРаспределения.Очистить();
		// Очистим флаг "На доходы и расходы"
		Для Каждого ТекущаяСтрока Из ТаблицаУслуг Цикл
			ТекущаяСтрока.НаДоходыИРасходы = ТекущаяСтрока.Номенклатура.СпособРаспределенияДопРасходов = Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы;
			ТекущаяСтрока.Нераспределено = 0;
		КонецЦикла;
		НеРаспределеноУслуги= 0;
		НаДоходыИРасходыУслуги = ТаблицаУслуг[0].НаДоходыИРасходы;
		Если ПересчитыватьДерево Тогда
			ПолучитьДеревоРаспределенияРасходов();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УстановкаРежимаРаспределения()

// Процедура обновления состава строк в таблице распределения
//
&НаСервере
Процедура ОбновлениеСоставаНоменклатурыРаспределения(ПодобраннаяНоменклатура)
	
	УслугаВыбора = ПодобраннаяНоменклатура.Услуга;
	НоменклатураПодбора = ПодобраннаяНоменклатура.РезультатПодбора;
	
	НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(Новый Структура("Услуга", УслугаВыбора));
	
	// Если имелись данные о распределении услуги ранее - проверим и заменим
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого ТекущаяСтрока Из НоменклатураПодбора Цикл
			ПараметрыОтбора = Новый Структура();
			ПараметрыОтбора.Вставить("ДокументОснование",          ТекущаяСтрока.ДокументОснование);
			ПараметрыОтбора.Вставить("Услуга",                     ТекущаяСтрока.Услуга);
			ПараметрыОтбора.Вставить("Номенклатура",               ТекущаяСтрока.Номенклатура);
			ПараметрыОтбора.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
			ПараметрыОтбора.Вставить("ЕдиницаИзмерения",           ТекущаяСтрока.ЕдиницаИзмерения);
			ПараметрыОтбора.Вставить("Коэффициент",                ТекущаяСтрока.Коэффициент);
			ПараметрыОтбора.Вставить("ГТД",                        ТекущаяСтрока.ГТД);
			НайденныеСтрокиНоменклатуры = ТаблицаРаспределения.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСтрокиНоменклатуры[0]);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			ТаблицаРаспределения.Удалить(ТекущаяСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	// Добавим выбранную номенклатуру в таблицу распределения
	Для Каждого ТекущаяСтрока Из НоменклатураПодбора Цикл
		НоваяСтрока = ТаблицаРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	СуммаРаспределения = 0;
	
	// Обновим дерево номенклатур
	Для Каждого ТекущийДокумент Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
		ТекущийДокумент.ПолучитьЭлементы().Очистить();
		НайденныеУслуги = ТаблицаРаспределения.НайтиСтроки(Новый Структура("ДокументОснование,Услуга", ТекущийДокумент.ДокументОснование,УслугаВыбора));
		Для Каждого ТекущаяНоменклатура Из НайденныеУслуги Цикл
			НоваяСтрока = ТекущийДокумент.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяНоменклатура,, "ДокументОснование");
			НоваяСтрока.СуммаДопРасходов       = ТекущаяНоменклатура.Сумма;
			НоваяСтрока.СуммаДопРасходовБезНДС = ТекущаяНоменклатура.СуммаБезНДС;
			СуммаРаспределения = СуммаРаспределения + НоваяСтрока.СуммаДопРасходов;
		КонецЦикла;
	КонецЦикла;
	
	СтрокаУслуги = ТаблицаУслуг.НайтиСтроки(Новый Структура("Номенклатура", УслугаВыбора));
	
	СтрокаУслуги[0].НеРаспределено = СтрокаУслуги[0].Сумма - СуммаРаспределения;
	
	Если РедактированиеУслуги Тогда
		НеРаспределеноУслуги = СтрокаУслуги[0].НеРаспределено;
	КонецЕсли;
	
КонецПроцедуры // ОбновлениеСоставаНоменклатурыРаспределения()

// Обработчик оповещения по результатам выбора в подчиненной форме номенклатуры
//
&НаКлиенте
Процедура Подключаемый_ОбработкаПодбораНоменклатуры(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ РезультатОповещения = Неопределено Тогда
		ОбновлениеСоставаНоменклатурыРаспределения(РезультатОповещения);
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_ОбработкаПодбораНоменклатуры()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Распределить по услуге" в контексте сервера.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаСервере
Процедура РаспределитьПоУслугеНаСервере()
	
	Если РедактированиеУслуги Тогда
		СтрокаУслуги = ТаблицаУслуг[0];
	Иначе
		СтрокаУслуги = ТаблицаУслуг.НайтиПоИдентификатору(Элементы.ТаблицаУслуг.ТекущаяСтрока);
	КонецЕсли;
	
	ТаблицаРаспределенияСумм = АвтоматическоеРаспределениеСуммыУслуги(СтрокаУслуги, Истина);
	
	СуммаРаспределения = 0;
	
	Для Каждого ТекущийДокумент Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
		Для Каждого ТекущаяСтрока Из ТекущийДокумент.ПолучитьЭлементы() Цикл
			СтруктураПоиска = Новый Структура("ДокументОснование, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, ГТД");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
			СтруктураПоиска.ДокументОснование = ТекущийДокумент.ДокументОснование;
			НайденнаяНоменклатура = ТаблицаРаспределенияСумм.НайтиСтроки(СтруктураПоиска);
			ТекущаяСтрока.СуммаДопРасходов       = НайденнаяНоменклатура[0].СуммаВсего;
			ТекущаяСтрока.СуммаДопРасходовБезНДС = НайденнаяНоменклатура[0].СуммаВсего - НайденнаяНоменклатура[0].СуммаНДС;
			СуммаРаспределения = СуммаРаспределения + НайденнаяНоменклатура[0].СуммаВсего;
		КонецЦикла;
	КонецЦикла;
	
	ЗагрузитьДанныеРучногоРаспределенияСуммы(СтрокаУслуги);
	
	СтрокаУслуги.НеРаспределено = СтрокаУслуги.Сумма - СуммаРаспределения;
	
	Если РедактированиеУслуги Тогда
		НеРаспределеноУслуги = СтрокаУслуги.НеРаспределено;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события нажатия кнопки "Распределить по услуге".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура РаспределитьПоУслуге(Команда)
	
	РаспределитьПоУслугеНаСервере();
	
КонецПроцедуры // РаспределитьПоУслуге()

// Обработчик события нажатия кнопки "Распределить равномерно" в контексте сервера.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаСервере
Процедура РаспределитьРавномерноНаСервере()
	
	Если РедактированиеУслуги Тогда
		СтрокаУслуги = ТаблицаУслуг[0];
	Иначе
		СтрокаУслуги = ТаблицаУслуг.НайтиПоИдентификатору(Элементы.ТаблицаУслуг.ТекущаяСтрока);
	КонецЕсли;
	
	СуммаРаспределенияУслуги = СтрокаУслуги.Сумма;
	СуммаРаспределенияУслугиБезНДС = СтрокаУслуги.СуммаБезНДС;
	
	// Заполним ТаблицаРаспределения автоматически
	ЗагрузитьДанныеРучногоРаспределенияСуммы(СтрокаУслуги);
	
	// Проверим наличие ручного распределения услуги
	НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(Новый Структура("Услуга", СтрокаУслуги.Номенклатура));
	КоличествоЗаписей = НайденныеСтроки.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		СуммаРаспределенияУслуге = Окр(СуммаРаспределенияУслуги / КоличествоЗаписей, 2, РежимОкругления.Окр15как10);
		СуммаРаспределенияУслугеБезНДС = Окр(СуммаРаспределенияУслугиБезНДС / КоличествоЗаписей, 2, РежимОкругления.Окр15как10);
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			ТекущаяСтрока.Сумма = СуммаРаспределенияУслуге;
			ТекущаяСтрока.СуммаБезНДС = СуммаРаспределенияУслугеБезНДС;
		КонецЦикла;
		
		ОстатокСуммы = СуммаРаспределенияУслуги - СуммаРаспределенияУслуге * КоличествоЗаписей;
		ОстатокСуммыБезНДС = СуммаРаспределенияУслугиБезНДС - СуммаРаспределенияУслугеБезНДС * КоличествоЗаписей;
		
		Если ОстатокСуммы <> 0 ИЛИ ОстатокСуммыБезНДС <> 0 Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Сумма + ОстатокСуммы;
			ТекущаяСтрока.СуммаБезНДС = ТекущаяСтрока.СуммаБезНДС + ОстатокСуммыБезНДС;
		КонецЕсли;
		
	КонецЕсли;
	
	СуммаРаспределения = 0;
	
	Если КоличествоЗаписей = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущийДокумент Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
		Для Каждого ТекущаяСтрока Из ТекущийДокумент.ПолучитьЭлементы() Цикл
			СтруктураПоиска = Новый Структура("ДокументОснование, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, ГТД, Услуга");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
			СтруктураПоиска.ДокументОснование = ТекущийДокумент.ДокументОснование;
			СтруктураПоиска.Услуга = СтрокаУслуги.Номенклатура;
			НайденнаяНоменклатура = ТаблицаРаспределения.НайтиСтроки(СтруктураПоиска);
			ТекущаяСтрока.СуммаДопРасходов       = НайденнаяНоменклатура[0].Сумма;
			ТекущаяСтрока.СуммаДопРасходовБезНДС = НайденнаяНоменклатура[0].СуммаБезНДС;
			СуммаРаспределения = СуммаРаспределения + ТекущаяСтрока.СуммаДопРасходов;
		КонецЦикла;
	КонецЦикла;
	
	
	СтрокаУслуги.НеРаспределено = СтрокаУслуги.Сумма - СуммаРаспределения;
	
	Если РедактированиеУслуги Тогда
		НеРаспределеноУслуги = СтрокаУслуги.НеРаспределено;
	КонецЕсли;
	
КонецПроцедуры // РаспределитьРавномерноНаСервере()

// Обработчик события нажатия кнопки "Распределить равномерно".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура РаспределитьРавномерно(Команда)
	
	РаспределитьРавномерноНаСервере();
	
КонецПроцедуры // РаспределитьРавномерно()

// Обработчик события нажатия кнопки "Подобрать номенклатуру".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатурыДокументовОснований(Команда)
	
	Если РедактированиеУслуги Тогда
		ВыбраннаяУслуга = Услуга;
	Иначе
		ТекущиеДанные = Элементы.ТаблицаУслуг.ТекущиеДанные;
		ВыбраннаяУслуга = ТекущиеДанные.Номенклатура;
	КонецЕсли;
	
	// Запомним данные ручного распределения
	ЗагрузитьДанныеРучногоРаспределенияСуммы(Новый Структура("Номенклатура,НаДоходыИРасходы", ВыбраннаяУслуга, Ложь));
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТаблицаОснований",     ТаблицаОснований);
	ПараметрыФормы.Вставить("ТаблицаРаспределения", ТаблицаРаспределения);
	ПараметрыФормы.Вставить("Услуга",               ВыбраннаяУслуга);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаПодбораНоменклатуры", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ПоступлениеДопРасходов.Форма.ПодборНоменклатурыИзДокументовОснований", ПараметрыФормы, ЭтотОбъект,,,, ОбработчикОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ПодборНоменклатурыДокументовОснований()

// Обработчик события нажатия кнопки "Применить" в контексте сервера.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаСервере
Процедура ПрименитьНаСервере()
	
	Если РежимРаспределения = 1 Тогда
		Проверка = Истина;
		
		// Проверим возможность использования галки ДиР
		Для Каждого ТекущаяСтрока Из ТаблицаУслуг Цикл
			Если ТекущаяСтрока.НеРаспределено <> 0 Тогда
				ВывестиСообщение(НСтр("ru = 'Не распределена сумма услуги ""%1""'"),,,,, ТекущаяСтрока.Номенклатура);
				Проверка = Ложь;
			КонецЕсли;
			Если ТекущаяСтрока.НаДоходыИРасходы И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура.СтатьяДопРасходов) Тогда
				ВывестиСообщение(НСтр("ru = 'Для услуги ""%1"" нельзя применить распределение ""На доходы и расходы"". В услуге не указана статья дополнительных расходов.'"),,,,, ТекущаяСтрока.Номенклатура);
				Проверка = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ Проверка Тогда
			Возврат;
		КонецЕсли;
		
		// Проверить для всех ли распределена сумма дополнительных расходов
		Для Каждого ТекущаяСтрока Из ТаблицаУслуг Цикл
			Если ТекущаяСтрока.НаДоходыИРасходы Тогда
				Продолжить;
			КонецЕсли;
			РаспределениеПоУслуге = ТаблицаРаспределения.НайтиСтроки(Новый Структура("Услуга", ТекущаяСтрока.Номенклатура));
			Если РаспределениеПоУслуге.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			ТаблицаРаспределенияСумм = АвтоматическоеРаспределениеСуммыУслуги(ТекущаяСтрока, Истина);
			Для Каждого СтрокаРаспределения Из ТаблицаРаспределенияСумм Цикл
				НоваяСтрока = ТаблицаРаспределения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
				НоваяСтрока.Услуга = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Сумма = СтрокаРаспределения.СуммаВсего;
				НоваяСтрока.СуммаБезНДС = СтрокаРаспределения.СуммаВсего - СтрокаРаспределения.СуммаНДС;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	РезультатРаспределения = Новый Структура();
	РезультатРаспределения.Вставить("СпособРаспределения", РежимРаспределения);
	РезультатРаспределения.Вставить("ТаблицаРаспределения", ТаблицаРаспределения.Выгрузить());
	РезультатРаспределения.Вставить("Услуга", Услуга);
	
	АдресРезультатаРаспределения = ПоместитьВоВременноеХранилище(РезультатРаспределения);
	
КонецПроцедуры // ПрименитьНаСервере()

// Обработчик события нажатия кнопки "Применить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Применить(Команда)
	
	ПрименитьНаСервере();
	
	Если НЕ ПустаяСтрока(АдресРезультатаРаспределения) Тогда
		Закрыть(АдресРезультатаРаспределения);
	КонецЕсли;
	
КонецПроцедуры // Применить()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события возникающего при изменении реквизита "Режим распределения".
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура РежимРаспределенияПриИзменении(Элемент)
	
	УстановкаРежимаРаспределения();
	
	РазвернутьДеревоНоменклатуры();
	
КонецПроцедуры // РежимРаспределенияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "На доходы и расходы услуги" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура НаДоходыИРасходыУслугиПриИзмененииНаСервере()
	
	Если РедактированиеУслуги Тогда
		СтрокаУслуги = ТаблицаУслуг[0];
	Иначе
		СтрокаУслуги = ТаблицаУслуг.НайтиПоИдентификатору(Элементы.ТаблицаУслуг.ТекущаяСтрока);
	КонецЕсли;
	
	// Запомним данные редактирования
	ЗагрузитьДанныеРучногоРаспределенияСуммы(СтрокаУслуги);
	
	ПолучитьДеревоРаспределенияРасходов();
	
	// Заблокируем
	НаДоходыИРасходы = СтрокаУслуги.НаДоходыИРасходы;
	
	Если НаДоходыИРасходы Тогда
		СтрокаУслуги.НеРаспределено = 0;
		Если РедактированиеУслуги Тогда
			НеРаспределеноУслуги = 0;
		КонецЕсли;
	Иначе
		// Рассчитаем сумму сколько не распределено
		СуммаРаспределено = 0;
		
		Для Каждого ДокументОснование Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
			Для Каждого ТекущаяСтрока Из ДокументОснование.ПолучитьЭлементы() Цикл
				СуммаРаспределено = СуммаРаспределено + ТекущаяСтрока.СуммаДопРасходов;
			КонецЦикла;
		КонецЦикла;
		
		СтрокаУслуги.НеРаспределено = СтрокаУслуги.Сумма - СуммаРаспределено;
		
		Если РедактированиеУслуги Тогда
			НеРаспределеноУслуги = СтрокаУслуги.Сумма - СуммаРаспределено;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ДеревоНоменклатуры.ТолькоПросмотр = НаДоходыИРасходы;
	Элементы.ПодборНоменклатурыДокументовОснований.Доступность = НЕ НаДоходыИРасходы;
	Элементы.УдалитьНоменклатуру.Доступность = НЕ НаДоходыИРасходы;
	Элементы.ПодменюРаспределить.Доступность = НЕ НаДоходыИРасходы;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "На доходы и расходы услуги".
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура НаДоходыИРасходыУслугиПриИзменении(Элемент)
	
	ТаблицаУслуг[0].НаДоходыИРасходы = НаДоходыИРасходыУслуги;
	
	НаДоходыИРасходыУслугиПриИзмененииНаСервере();
	
	РазвернутьДеревоНоменклатуры();
	
КонецПроцедуры // НаДоходыИРасходыУслугиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "На доходы и расходы услуги".
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ТаблицаУслугНаДоходыИРасходыПриИзменении(Элемент)
	
	Если АктивизацияУслуги Тогда
		ИзменениеДиР = Истина;
		АктивизацияУслуги = Ложь;
		ПолучитьДеревоРаспределенияРасходов();
	КонецЕсли;
	
	НаДоходыИРасходыУслугиПриИзмененииНаСервере();
	
	РазвернутьДеревоНоменклатуры();
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТаблицаУслугПриАктивизацииСтроки(Элемент)
	
	АктивизацияУслуги = Истина;
	
	// Производим подключение обработчика события выполняемого с задержкой
	ПодключитьОбработчикОжидания("Подключаемый_СписокПриАктивизацииСтрокиУслуг", 0.1, ИСТИНА);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "СуммаДопРасходов" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДеревоНоменклатурыСуммаДопРасходовПриИзмененииНаСервере()
	
	ТекущиеДанныеНоменклатуры = ДеревоНоменклатуры.НайтиПоИдентификатору(Элементы.ДеревоНоменклатуры.ТекущаяСтрока);
	Если РедактированиеУслуги Тогда
		СтрокаУслуги = ТаблицаУслуг[0];
	Иначе
		СтрокаУслуги = ТаблицаУслуг.НайтиПоИдентификатору(Элементы.ТаблицаУслуг.ТекущаяСтрока);
	КонецЕсли;
	
	// Рассчитаем сумму сколько не распределено
	СуммаРаспределено = 0;
	
	Для Каждого ДокументОснование Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
		Для Каждого ТекущаяСтрока Из ДокументОснование.ПолучитьЭлементы() Цикл
			СуммаРаспределено = СуммаРаспределено + ТекущаяСтрока.СуммаДопРасходов;
		КонецЦикла;
	КонецЦикла;
	
	СтрокаУслуги.НеРаспределено = СтрокаУслуги.Сумма - СуммаРаспределено;
	
	Если РедактированиеУслуги Тогда
		НеРаспределеноУслуги = СтрокаУслуги.Сумма - СуммаРаспределено;
	КонецЕсли;
	
	СтрокаУслугиСуммаБезНДС = СуммаРаспределено - (СтрокаУслуги.Сумма - СтрокаУслуги.СуммаБезНДС);
	
	// Рассчитаем сумму НДС
	СуммаБезНДСРаспределения = 0;
	Для Каждого ДокументОснование Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
		Для Каждого ТекущаяСтрока Из ДокументОснование.ПолучитьЭлементы() Цикл
			ТекущаяСтрока.СуммаДопРасходовБезНДС = Окр(ТекущаяСтрока.СуммаДопРасходов / ?(СуммаРаспределено = 0, 1, СуммаРаспределено) * СтрокаУслугиСуммаБезНДС, 2);
			СуммаБезНДСРаспределения = СуммаБезНДСРаспределения + ТекущаяСтрока.СуммаДопРасходовБезНДС;
		КонецЦикла;
	КонецЦикла;
	
	Остаток = СтрокаУслугиСуммаБезНДС - СуммаБезНДСРаспределения;
	Если Остаток > 0 Тогда
		ТекущаяСтрока.СуммаДопРасходовБезНДС = ТекущаяСтрока.СуммаДопРасходовБезНДС + Остаток;
	КонецЕсли;
	
	// Запомним данные редактирования
	ЗагрузитьДанныеРучногоРаспределенияСуммы(СтрокаУслуги);
	
КонецПроцедуры // ДеревоНоменклатурыСуммаДопРасходовПриИзмененииНаСервере()

// Обработчик события возникающего при изменении данных реквизита "СуммаДопРасходов".
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ДеревоНоменклатурыСуммаДопРасходовПриИзменении(Элемент)
	
	ДеревоНоменклатурыСуммаДопРасходовПриИзмененииНаСервере();
	
КонецПроцедуры // ДеревоНоменклатурыСуммаДопРасходовПриИзменении()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ДеревоНоменклатурыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоНоменклатуры.ТекущиеДанные;
	
	// Если у нас текущая строка - документ основание, то отменим удаление
	Отказ = ТекущиеДанные = Неопределено ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ДокументОснование);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
&НаСервере
Процедура ДеревоНоменклатурыПослеУдаленияНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = ТаблицаУслуг.НайтиПоИдентификатору(Элементы.ТаблицаУслуг.ТекущаяСтрока);
	
	// Рассчитаем сумму сколько не распределено
	СуммаРаспределено = 0;
	
	Для Каждого ДокументОснование Из ДеревоНоменклатуры.ПолучитьЭлементы() Цикл
		Для Каждого ТекущаяСтрока Из ДокументОснование.ПолучитьЭлементы() Цикл
			СуммаРаспределено = СуммаРаспределено + ТекущаяСтрока.СуммаДопРасходов;
		КонецЦикла;
	КонецЦикла;
	
	ТекущиеДанные.НеРаспределено = ТекущиеДанные.Сумма - СуммаРаспределено;
	
	Если РедактированиеУслуги Тогда
		НеРаспределеноУслуги = ТекущиеДанные.НеРаспределено;
	КонецЕсли;
	
	ЗагрузитьДанныеРучногоРаспределенияСуммы(ТекущиеДанные);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДеревоНоменклатурыПослеУдаления(Элемент)
	
	ДеревоНоменклатурыПослеУдаленияНаСервере();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Получим параметры формы
	РедактированиеУслуги  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "РедактированиеУслуги", Ложь);
	РежимРаспределения    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СпособРаспределения", 0);
	РаспределениеРасходов = ПолучитьЗначениеПараметраСтруктуры(Параметры, "РаспределениеРасходов");
	ДокументыОснования    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументыОснования");
	ТипЦен                = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТипЦен");
	
	// Получим таблицу номенклатур и документов оснований
	Если НЕ ДокументыОснования = Неопределено Тогда
		ТаблицаНоменклатурыОснований = Документы.ПоступлениеДопРасходов.ПолучитьНоменклатуруПоОснованиям(ДокументыОснования.Выгрузить(, "ДокументОснование"));
		Если НЕ ТаблицаНоменклатурыОснований = Неопределено Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаНоменклатурыОснований Цикл
				НоваяСтрока = ТаблицаОснований.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаОснований.Количество() = 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Для документов в табличной части ""Документы-основания"" нельзя применить распределение дополнительных расходов.'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	// Проверим режим распределения доп расходов
	Если РедактированиеУслуги Тогда
		Услуга      = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Услуга");
		СуммаУслуг  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СуммаУслуги");
		СуммаНДС    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СуммаНДСУслуги");
		
		СуммаУслуги       = СуммаУслуг;
		СуммаБезНДСУслуги = СуммаУслуг - СуммаНДС;
		
		НоваяСтрока = ТаблицаУслуг.Добавить();
		НоваяСтрока.Номенклатура     = Услуга;
		НоваяСтрока.Сумма            = СуммаУслуги;
		НоваяСтрока.СуммаБезНДС      = СуммаБезНДСУслуги;
		
		Элементы.ТаблицаУслуг.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.СтраницаУслуг.Видимость = Ложь;
	Иначе
		УслугиДокумента = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Услуги");
		
		Если УслугиДокумента = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// Заполним табличную часть 
		Для Каждого ТекущаяСтрока Из УслугиДокумента Цикл
			НоваяСтрока = ТаблицаУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Сумма       = ТекущаяСтрока.СуммаВсего;
			НоваяСтрока.СуммаБезНДС = ТекущаяСтрока.СуммаВсего - ТекущаяСтрока.СуммаНДС;
			РежимРаспределения = ?(ТекущаяСтрока.СпособРаспределения = 1, 1, РежимРаспределения);
		КонецЦикла;
		
		Если ТаблицаУслуг.Количество() > 0 Тогда
			Элементы.ТаблицаУслуг.ТекущаяСтрока = ТаблицаУслуг[0].ПолучитьИдентификатор();
		КонецЕсли;
		Элементы.СтраницаУслуги.Видимость = Ложь;
	КонецЕсли;
	
	// Получение таблицы распределения доп. расходов документа
	Если НЕ РаспределениеРасходов = Неопределено Тогда
		
		// Проверим, не было ли изменений в составе документов-оснований
		Для Каждого ТекущаяСтрока Из РаспределениеРасходов Цикл
			СтруктураПоиска = Новый Структура("ДокументОснование, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, ГТД");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
			СтруктураПоиска.Номенклатура = ТекущаяСтрока.НоменклатураРаспределения;
			НайденнаяНоменклатура = ТаблицаОснований.НайтиСтроки(СтруктураПоиска);
			Если НайденнаяНоменклатура.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТаблицаРаспределения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Номенклатура = ТекущаяСтрока.НоменклатураРаспределения;
		КонецЦикла;
		
		ВременнаяТаблица = ТаблицаРаспределения.Выгрузить(, "Услуга,Сумма");
		ВременнаяТаблица.Свернуть("Услуга", "Сумма");
		
		Для Каждого ТекущаяСтрока Из ТаблицаУслуг Цикл
			СтрокаРаспределения = ВременнаяТаблица.Найти(ТекущаяСтрока.Номенклатура, "Услуга");
			Если НЕ СтрокаРаспределения = Неопределено Тогда
				ТекущаяСтрока.НеРаспределено = ТекущаяСтрока.Сумма - СтрокаРаспределения.Сумма;
			КонецЕсли;
			
			// Рассчитаем сумму без ндс для распределенной номенклатуры
			НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(Новый Структура("Услуга", ТекущаяСтрока.Номенклатура));
			Если НайденныеСтроки.Количество() > 0 Тогда
				СуммаБезНДСРаспределения = 0;
				Для Каждого ТекущаяНоменклатура Из НайденныеСтроки Цикл
					ТекущаяНоменклатура.СуммаБезНДС = Окр(ТекущаяНоменклатура.Сумма / ТекущаяСтрока.Сумма * ТекущаяСтрока.СуммаБезНДС, 2);
					СуммаБезНДСРаспределения = СуммаБезНДСРаспределения + ТекущаяНоменклатура.СуммаБезНДС;
				КонецЦикла;
				Остаток = ТекущаяСтрока.СуммаБезНДС - СуммаБезНДСРаспределения;
				Если Остаток > 0 Тогда
					ТекущаяНоменклатура.СуммаБезНДС = ТекущаяНоменклатура.СуммаБезНДС + Остаток;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если РедактированиеУслуги Тогда
			НеРаспределеноУслуги = ТаблицаУслуг[0].НеРаспределено;
		КонецЕсли;
		
		// Расстановка галки "На доходы и расходы"
		Если РедактированиеУслуги Тогда
			НаДоходыИРасходыУслуги = (РежимРаспределения = 0 И Услуга.СпособРаспределенияДопРасходов = Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы)
									ИЛИ (РежимРаспределения = 1 И РаспределениеРасходов.НайтиСтроки(Новый Структура("Услуга", Услуга)).Количество() = 0);
			ТаблицаУслуг[0].НаДоходыИРасходы = НаДоходыИРасходыУслуги;
		Иначе
			Для Каждого ТекущаяСтрока Из ТаблицаУслуг Цикл
				СпособРаспределения = УслугиДокумента.НайтиСтроки(Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура))[0].СпособРаспределения;
				ТекущаяСтрока.НаДоходыИРасходы = (СпособРаспределения = 0 И ТекущаяСтрока.Номенклатура.СпособРаспределенияДопРасходов = Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы)
												ИЛИ (СпособРаспределения = 1 И РаспределениеРасходов.НайтиСтроки(Новый Структура("Услуга", ТекущаяСтрока.Номенклатура)).Количество() = 0);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ПолучитьДеревоРаспределенияРасходов();
	
	УстановкаРежимаРаспределения(Ложь);
	
	// Отображение кода и артикула номенклатуры
	ОтображатьАртикул = ПолучитьФункциональнуюОпцию("ИспользоватьАртикул");
	
	// Установим видимость служебных колонок в зависимости от значения функциональной опции.
	Элементы.ДеревоНоменклатурыНоменклатураАртикул.Видимость = (ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.Артикул ИЛИ ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.КодИАртикул);
	Элементы.ДеревоНоменклатурыНоменклатураКод.Видимость     = (ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.Код     ИЛИ ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.КодИАртикул);
	
	// Видимость характеристики номенклатуры - если есть строка с характеристикой, то выводим.
	ВидимостьХарактеристики = Ложь;
	Для Каждого ТекущаяСтрока Из ТаблицаОснований Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
			ВидимостьХарактеристики = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Элементы.ДеревоНоменклатурыХарактеристикаНоменклатуры.Видимость = ВидимостьХарактеристики;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Проверим возможность открытия формы
	Если ЭтотОбъект.ВладелецФормы = Неопределено Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Запрещен самостоятельный вызов.'"),,
			НСтр("ru = 'Данная форма используется другими объектами конфигурации.'"),
			БиблиотекаКартинок.Предупреждение32,
			СтатусОповещенияПользователя.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	РазвернутьДеревоНоменклатуры();
	
КонецПроцедуры  // ПриОткрытии()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
